tap "felixkratz/formulae"
tap "homebrew/cask"
tap "nikitabobko/tap"
brew "libpng"
brew "btop"
brew "cloudflared"
brew "cmake"
brew "dua-cli"
brew "duf"
brew "ffmpeg-full"
brew "ffmpeg@6", link: true
brew "gcc"
brew "gh"
brew "git"
brew "gnu-getopt"
brew "libtool"
brew "jenv"
brew "just"
brew "luarocks"
brew "media-control"
brew "protobuf"
brew "mosh"
brew "mutt"
brew "neovim"
brew "ninja"
brew "node"
brew "open-ocd"
brew "openjdk@17"
brew "openjdk@21"
brew "openvpn"
brew "python@3.10"
brew "ripgrep"
brew "tinymist"
brew "tmux"
brew "tree"
brew "tree-sitter-cli"
brew "typst"
brew "wget"
brew "xclip"
brew "zsh-syntax-highlighting"
brew "felixkratz/formulae/sketchybar"
cask "nikitabobko/tap/aerospace"
cask "copilot-cli"
cask "font-hack-nerd-font"
cask "kitty"
cask "mitmproxy"
cask "scroll-reverser"
cask "supercollider"
cargo "cross"
cargo "dioxus-cli"
cargo "mdbook"
cargo "ripgrep"
cargo "typst-live"
cargo "typst-ts-cli"
npm "@github/copilot"
